<?php

return [
    'admin' => [
        'news' => [
            'create' => [
                'success' => 'Новость успешно добавлена',
                'fail' => 'Ошибка добавления новости'
            ],
            'update' => [
                'success' => 'Новость успешно обновлена',
                'fail' => 'Ошибка обновления новости'
            ]
        ],
        'categories' => [
            'create' => [
                'success' => 'Категория успешно добавлена',
                'fail' => 'Ошибка добавления категории'
            ],
            'update' => [
                'success' => 'Категория успешно обновлена',
                'fail' => 'Ошибка обновления категории'
            ]
        ],
        'orders' => [
            'create' => [
                'success' => 'Заказ успешно добавлен',
                'fail' => 'Ошибка добавления заказа'
            ],
            'update' => [
                'success' => 'Заказ успешно обновлен',
                'fail' => 'Ошибка обновления заказа'
            ]
        ],
        'sources' => [
            'create' => [
                'success' => 'Источник новостей успешно добавлен',
                'fail' => 'Ошибка добавления источника новостей'
            ],
            'update' => [
                'success' => 'Источник новостей успешно обновлен',
                'fail' => 'Ошибка обновления источника новостей'
            ]
        ],
        'users' => [
            'update' => [
                'success' => 'Пользователь успешно обновлен',
                'fail' => 'Ошибка обновления пользователя'
            ]
        ]
    ],
    'orders' => [
        'create' => [
            'success' => 'Ваш заказ успешно создан',
            'fail' => 'Ошибка создания заказа'
        ]
    ],
    'reviews' => [
        'create' => [
            'success' => 'Ваш отзыв успешно добавлен',
            'fail' => 'Ошибка добавления отзыва'
        ]
    ],
    'account' => [
        'update' => [
            'success' => 'Ваш профиль был успешно обновлен',
            'fail' => 'Ошибка обновления профиля'
        ]
    ]
];
